<a href="https://colab.research.google.com/github/lucianocoelho-28/desafios-bootcamps-dio/blob/main/treino_titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Dados do Titanic
https://www.kaggle.com

In [1]:
import pandas as pd
import numpy as np
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split

# Lendo o Banco de Dados

In [2]:
df = pd.read_csv("/content/train.csv")

In [3]:
df.head(10)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

In [4]:
df = df.drop(["Name", "Ticket", "Cabin", "Embarked"], axis = 1)

In [5]:
df = df.set_index(["PassengerId"])
df = df.rename(columns={"Survived" : "Target"}, inplace = False)

In [6]:
df.head(10)

             Target  Pclass     Sex   Age  SibSp  Parch     Fare
PassengerId
1                 0       3    male  22.0      1      0   7.2500
2                 1       1  female  38.0      1      0  71.2833
3                 1       3  female  26.0      0      0   7.9250
4                 1       1  female  35.0      1      0  53.1000
5                 0       3    male  35.0      0      0   8.0500
6                 0       3    male   NaN      0      0   8.4583
7                 0       1    male  54.0      0      0  51.8625
8                 0       3    male   2.0      3      1  21.0750
9                 1       3  female  27.0      0      2  11.1333
10                1       2  female  14.0      1      0  30.0708

In [7]:
df.describe()

           Target      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Target  891 non-null    int64
 1   Pclass  891 non-null    int64
 2   Sex     891 non-null    object
 3   Age     714 non-null    float64
 4   SibSp   891 non-null    int64
 5   Parch   891 non-null    int64
 6   Fare    891 non-null    float64
dtypes: float64(2), int64(4), object(1)
memory usage: 55.7+ KB

In [9]:
df.describe(include=["O"])

         Sex
count    891
unique     2
top     male
freq     577

In [10]:
df['Sex_f'] = np.where(df['Sex'] == 'female', 1, 0)
df['Pclass_1'] = np.where(df['Pclass'] == 1, 1, 0)
df['Pclass_2'] = np.where(df['Pclass'] == 2, 1, 0)
df['Pclass_3'] = np.where(df['Pclass'] == 3, 1, 0)

In [11]:
df = df.drop(['Sex', 'Pclass'], axis = 1)

In [12]:
df.head(10)

             Target   Age  SibSp  Parch  ...  Sex_f  Pclass_1  Pclass_2  Pclass_3
PassengerId                              ...
1                 0  22.0      1      0  ...      0         0         0         1
2                 1  38.0      1      0  ...      1         1         0         0
3                 1  26.0      0      0  ...      1         0         0         1
4                 1  35.0      1      0  ...      1         1         0         0
5                 0  35.0      0      0  ...      0         0         0         1
6                 0   NaN      0      0  ...      0         0         0         1
7                 0  54.0      0      0  ...      0         1         0         0
8                 0   2.0      3      1  ...      0         0         0         1
9                 1  27.0      0      2  ...      1         0         0         1
10                1  14.0      1      0  ...      1         0         1         0

[10 rows x 9 columns]

In [13]:
df.isnull().sum()

Target        0
Age         177
SibSp         0
Parch         0
Fare          0
Sex_f         0
Pclass_1      0
Pclass_2      0
Pclass_3      0
dtype: int64

In [14]:
df.fillna(0, inplace=True)

In [15]:
df.head(4)

             Target   Age  SibSp  Parch  ...  Sex_f  Pclass_1  Pclass_2  Pclass_3
PassengerId                              ...
1                 0  22.0      1      0  ...      0         0         0         1
2                 1  38.0      1      0  ...      1         1         0         0
3                 1  26.0      0      0  ...      1         0         0         1
4                 1  35.0      1      0  ...      1         1         0         0

[4 rows x 9 columns]

In [16]:
df.isnull().sum()

Target      0
Age         0
SibSp       0
Parch       0
Fare        0
Sex_f       0
Pclass_1    0
Pclass_2    0
Pclass_3    0
dtype: int64

In [17]:
x_train, x_test, y_train, y_test = train_test_split(df.drop(['Target'], axis=1),
                                                    df['Target'],
                                                    test_size = 0.3,
                                                    random_state = 1234)

[{'treino' : x_train.shape}, {'teste' : x_test.shape}]

[{'treino': (623, 8)}, {'teste': (268, 8)}]

In [18]:
rndforest = RandomForestClassifier(n_estimators = 1000,
                                   criterion='gini',
                                   max_depth = 5)

rndforest.fit(x_train, y_train)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=5, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=1000,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [19]:
probabilidade = rndforest.predict_proba(df.drop('Target', axis=1))[:,1]
classificacao = rndforest.predict(df.drop('Target', axis=1))

In [20]:
df['Probabilidade'] = probabilidade
df['Classificacao'] = classificacao

In [21]:
df.head(10)

             Target   Age  SibSp  ...  Pclass_3  Probabilidade  Classificacao
PassengerId                       ...
1                 0  22.0      1  ...         1       0.122221              0
2                 1  38.0      1  ...         0       0.935576              1
3                 1  26.0      0  ...         1       0.432391              0
4                 1  35.0      1  ...         0       0.915703              1
5                 0  35.0      0  ...         1       0.138959              0
6                 0   0.0      0  ...         1       0.150148              0
7                 0  54.0      0  ...         0       0.371060              0
8                 0   2.0      3  ...         1       0.277165              0
9                 1  27.0      0  ...         1       0.475262              0
10                1  14.0      1  ...         0       0.828428              1

[10 rows x 11 columns]